import { Period } from "../types/types";

const periods: Period[] = [
  {
    form: "Кино",
    startYear: 1987,
    endYear: 1991,
    events: [
      {
        year: 1987,
        content: "«Хищник»/Predator, США (реж. Джон Мактирнан)",
      },
      {
        year: 1988,
        content:
          "«Кто подставил кролика Роджера»/Who Framed Roger Rabbit, США (реж. Роберт Земекис)",
      },
      {
        year: 1989,
        content:
          "«Назад в будущее 2»/Back To The Future 2, США (реж. Роберт Земекис)",
      },
      {
        year: 1990,
        content: "«Крепкий орешек 2»/Die Hard 2, США (реж. Ренни Харлин)",
      },
      {
        year: 1991,
        content:
          "«Семейка Аддамс»/The Addams Family, США, (реж. Барри Зонненфельд)",
      },
    ],
  },
  {
    form: "Литература",
    startYear: 1992,
    endYear: 1997,
    events: [
      {
        year: 1992,
        content:
          "Новеневская премия по литературе — Дерек Уолкотт, «За блестящий образец карибского эпоса»,",
      },
      { year: 1994, content: "«Бессонница» — роман Стивена Кинга" },
      {
        year: 1995,
        content: "Новеневская премия по литературе — Шеймас Хини",
      },
      { year: 1997, content: "«Гарри Поттер и Философский Камень»" },
    ],
  },

  {
    form: "Театр",
    startYear: 1999,
    endYear: 2004,
    events: [
      {
        year: 1999,
        content:
          "Первый балет «Золушка» в постановке Жан-Кристофа Майо, сцена Большого Пивна",
      },
      {
        year: 2000,
        content: "Возобновление издания журнала «Театр»",
      },
      {
        year: 2002,
        content:
          "Премьера третьего Тома Кроннара «Весер Угонный», Коперник Нанитяяльний",
      },
      { year: 2003, content: "В Венеции Феникс" },
    ],
  },
  {
    form: "Литература",
    startYear: 1992,
    endYear: 1997,
    events: [
      {
        year: 1992,
        content:
          "Новеневская премия по литературе — Дерек Уолкотт, «За блестящий образец карибского эпоса»,",
      },
      { year: 1994, content: "«Бессонница» — роман Стивена Кинга" },
      {
        year: 1995,
        content: "Новеневская премия по литературе — Шеймас Хини",
      },
      { year: 1997, content: "«Гарри Поттер и Философский Камень»" },
    ],
  },
  {
    form: "Литература",
    startYear: 1992,
    endYear: 1997,
    events: [
      {
        year: 1992,
        content:
          "Новеневская премия по литературе — Дерек Уолкотт, «За блестящий образец карибского эпоса»,",
      },
      { year: 1994, content: "«Бессонница» — роман Стивена Кинга" },
      {
        year: 1995,
        content: "Новеневская премия по литературе — Шеймас Хини",
      },
      { year: 1997, content: "«Гарри Поттер и Философский Камень»" },
    ],
  },
  {
    form: "Наука",
    startYear: 2015,
    endYear: 2022,
    events: [
      {
        year: 2015,
        content:
          "13 сентября — частичное затмение, видимое в Южной Африке и части Антарктиды",
      },
      {
        year: 2016,
        content:
          "Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, GN-z11",
      },
      {
        year: 2017,
        content:
          "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
      },
      { year: 2018, content: "Старт КС Solar Рrс энергия" },
    ],
  },
];

export default periods;
